load-testing/load-testing.yml
config:
  target: 'Hollacabs-Load-Balancer-1360933743.us-west-1.elb.amazonaws.com'
  phases:
    - duration: 60
      arrivalRate: 10
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
  payload: 
    path: "driver_id.csv"
    fields: 
      - "driver_id"
scenarios:
  - flow:
    - loop:
      - post:
          url: "/driverstatistics"
          json: 
            driverId: "{{driver_id}}"
          count: 15